{"Text": "Hi there, my name is Cesar. Can I order a 7 inch vanilla and chocolate birthday cake with cannoli filling and buttercream frosting for my wife Patricia's birthday for Thursday, July 4th? Please write out 'Happy Birthday Patricia!'", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hello! I’m Cesar. I’d like to order a 7-inch birthday cake featuring both vanilla and chocolate layers, filled with cannoli cream and finished with buttercream frosting, for my wife Patricia’s birthday on Thursday, July 4th. Please have it inscribed with 'Happy Birthday Patricia!'", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hi, this is Cesar. Could I place an order for a 7″ vanilla-and-chocolate birthday cake, filled with cannoli and topped with buttercream frosting, for my wife Patricia’s birthday on Thursday, July 4th? Please write “Happy Birthday Patricia!” on it.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hello! Steve and Karen here—we’d like a half-sheet vanilla & chocolate birthday cake with chocolate mousse and white chocolate mousse filling, nonrefundable, for Saturday, June 21. Could you put ‘Happy 65th Birthday Steve’ on it?", "Occasion": "birthday", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hi there—this is Steve and Karen. We’d like to order a half-sheet birthday cake with alternating vanilla and chocolate layers, filled with chocolate mousse and white chocolate mousse, and marked as nonrefundable. We need it for Saturday, June 21, with “Happy 65th Birthday Steve” written on top.", "Occasion": "birthday", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hello! Steve and Karen here. Could we please get a nonrefundable half-sheet vanilla-and-chocolate birthday cake, filled with chocolate mousse and white chocolate mousse, for Saturday, June 21? Please inscribe “Happy 65th Birthday Steve” on it.", "Occasion": "birthday", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hi Mary here! I’d like to place an order for a half-sheet vanilla and chocolate cake with cannoli filling, and buttercream frosting for my sister's gender reveal party this Saturday, March 22. The writing should say ‘A Little Wild Thing is on the way.’ Thank you!", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hello—Mary here! I’d like to order a half-sheet vanilla-and-chocolate cake with cannoli filling and buttercream frosting for my sister’s gender reveal party on Saturday, March 22. Please have it iced with “A Little Wild Thing is on the way.” Thank you!", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hi, this is Mary. Can I get a half-sheet cake featuring vanilla and chocolate layers, filled with cannoli and topped with buttercream frosting, for my sister’s gender reveal party this Saturday, March 22? Kindly write “A Little Wild Thing is on the way.” Thanks!", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Good morning! My name is Kim, I need a 10-inch vanilla cake with cannoli filling and BC frosting for Sunday, June 9. It is for my sister's baby shower. Please put ‘Congratulations Kiera.' on the cake.", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Good morning! I’m Kim. I’d like to order a 10-inch vanilla cake filled with cannoli cream and finished with buttercream frosting for my sister’s baby shower on Sunday, June 9. Please have it decorated with “Congratulations Kiera.”", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hi, this is Kim. Could I get a 10-inch vanilla cake with cannoli filling and BC frosting for my sister’s baby shower on Sunday, June 9? Please write 'Congratulations Kiera.'", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hi, this is Christine. My husband and I would like a custom two-tier marble cake with chocolate and white chocolate mousse filling for our wedding. I'd like the top layer to be 7 inches and the bottom layer to be 10 inches. Can you put buttercream frosting on it and have it ready for tomorrow?. Thank you!", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["marble"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["buttercream"]}
{"Text": "Hello, this is Christine. My husband and I would like to order a custom two-tier marble wedding cake with chocolate and white chocolate mousse filling. The top tier should be 7 inches and the bottom tier 10 inches, all covered in buttercream frosting. Please have it ready for tomorrow. Thank you!", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["buttercream"]}
{"Text": "Hi, I’m Christine. For our wedding, my husband and I would love a two-tier marble cake filled with chocolate and white chocolate mousse—7 inches on top and 10 inches on the bottom—with buttercream frosting. Could you have it prepared by tomorrow? Thanks!", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["buttercream"]}
{"Text": "Hey my name is Stacy. Can I order a 10-inch vanilla cake with chocolate mousse and Oreo filling, and buttercream frosting, for my daughters graduation party this weekend? Please write ‘Congratulations Brianna, Class of 2025.", "Occasion": "graduation", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["chocolate mousse", "oreo filling"], "Icing": ["buttercream"]}
{"Text": "Hi, I’m Stacy. I’d like to order a 10-inch vanilla cake filled with chocolate mousse and Oreo, topped with buttercream frosting, for my daughter’s graduation party this weekend. Please have it inscribed with “Congratulations Brianna, Class of 2025.”", "Occasion": "graduation", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["chocolate mousse", "oreo filling"], "Icing": ["buttercream"]}
{"Text": "Hello, Stacy here. Can I get a 10″ vanilla cake with chocolate mousse and Oreo filling, finished with buttercream, for my daughter’s graduation celebration this weekend? Kindly write “Congratulations Brianna, Class of 2025.”", "Occasion": "graduation", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["chocolate mousse", "oreo filling"], "Icing": ["buttercream"]}
{"Text": "Hello! This is Lorrane, I’d like a full-sheet vanilla & chocolate cake in a heart shape for my daughter's bridal shower. I want it to have white chocolate and chocolate mousse filling and white chocolate ganache frosting for Friday, February 14. Thank you!", "Occasion": "bridal shower", "Size": "full-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hi, I’m Lorrane. I’d like to order a heart-shaped full-sheet vanilla and chocolate cake, filled with both white chocolate and chocolate mousse, and finished with white chocolate ganache frosting for my daughter’s bridal shower on Friday, February 14. Thank you!", "Occasion": "bridal shower", "Size": "full-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello! This is Lorrane. Could I get a full-sheet, heart-shaped cake with vanilla and chocolate layers, stuffed with white chocolate and chocolate mousse filling, and covered in white chocolate ganache frosting for my daughter’s bridal shower on Friday, February 14? Thanks so much!", "Occasion": "bridal shower", "Size": "full-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hi, I’m Dave, a guidance counselor for queer folk!. Can you make a rainbow vanilla cake with a rainbow-colored layer design and buttercream frosting for Pride Day? I was looking to have it for Saturday, June 14. Please write ‘Happy Pride.'", "Occasion": "holiday", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["unspecified"], "Icing": ["buttercream"]}
{"Text": "Hey, I’m Dave—a guidance counselor for queer folk! Could I order a rainbow vanilla cake with rainbow-colored layers and buttercream frosting to celebrate Pride Day on Saturday, June 14? Please have it iced with “Happy Pride.”", "Occasion": "holiday", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["unspecified"], "Icing": ["buttercream"]}
{"Text": "Hi, this is Dave, a queer-community guidance counselor. I’d love a rainbow vanilla cake featuring rainbow-layered interior and topped with buttercream frosting for Pride Day on Saturday, June 14. Kindly write “Happy Pride” on it.", "Occasion": "holiday", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["unspecified"], "Icing": ["buttercream"]}
{"Text": "Good afternoon, my name is Patrick. I need a 7-inch confetti cake with vanilla custard filling and cream cheese icing, for St.Patrick's day. I want the theme to be green and yellow shamrocks.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["confetti"], "Filling": ["vanilla custard"], "Icing": ["cream cheese"]}
{"Text": "Good afternoon—this is Patrick. I’d like to order a 7-inch confetti cake with vanilla custard filling and cream cheese icing for St. Patrick’s Day. Please decorate it with green and yellow shamrocks.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla custard"], "Icing": ["cream cheese"]}
{"Text": "Hello, I’m Patrick. Can I get a 7-inch confetti cake filled with vanilla custard and cream cheese icing for St. Patrick’s Day? I’d love a green and yellow shamrock theme.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla custard"], "Icing": ["cream cheese"]}
{"Text": "Good morning, my name is Lisa. Can I get a quarter-sheet vanilla cake with vanilla custard filling and buttercream frosting? I want it in a heart shape for Valentine's Day! Please write ‘I Love You.’ on the cake", "Occasion": "holiday", "Size": "quarter-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Good morning! I’m Lisa. I’d like to order a heart-shaped quarter-sheet vanilla cake with vanilla custard filling and buttercream frosting, in celebration of Valentine’s Day. Please have it iced with “I Love You.”", "Occasion": "holiday", "Size": "quarter-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hello, my name is Lisa. Could I get a quarter-sheet vanilla cake, heart-shaped, filled with vanilla custard and topped with buttercream frosting, for Valentine’s Day? Please write “I Love You.” on it.", "Occasion": "holiday", "Size": "quarter-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["buttercream"]}
{"Text": "Hi this is Lee and Darleen. We’d like a 3 tier sheet vanilla cake with chocolate custard filling, and raspberry buttercream, for our grandchildrens Christening. Please put ‘Kaia Vera & Eamon Daniel.’", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["chocolate custard"], "Icing": ["raspberry buttercream"]}
{"Text": "Hello, this is Lee and Darleen. We’d like a three-tier vanilla sheet cake with chocolate custard filling and raspberry buttercream for our grandchildren’s Christening. Please write “Kaia Vera & Eamon Daniel.”", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["chocolate custard"], "Icing": ["raspberry buttercream"]}
{"Text": "Hi, Lee and Darleen here. Could we order a 3-tier vanilla sheet cake filled with chocolate custard and topped with raspberry buttercream for our grandchildren’s Christening? Kindly inscribe “Kaia Vera & Eamon Daniel.”", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["chocolate custard"], "Icing": ["raspberry buttercream"]}
{"Text": "Good morning—this is Colleen. Could I order a quarter-sheet almond and carrot cake with vanilla buttercream and chocolate mousse filling, and cookies and cream frosting for my husband's job anniversary ? I'd like it for today. Can you write ‘Badge #987 Salver.' on the cake.", "Occasion": "anniversary", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["almond", "carrot"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Good morning—this is Colleen. I’d like to order a quarter-sheet almond & carrot cake with vanilla buttercream and chocolate mousse filling, finished with cookies and cream frosting, for my husband’s job anniversary on today. Please have “Badge #987 Salver.” written on it.", "Occasion": "anniversary", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["almond", "carrot"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hi, I’m Colleen. Could I get a quarter-sheet cake combining almond and carrot layers, filled with vanilla buttercream and chocolate mousse and topped with cookies and cream frosting, to celebrate my husband’s work anniversary on today? Kindly inscribe “Badge #987 Salver.” on the cake.", "Occasion": "anniversary", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["almond", "carrot"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello this is Sinead. I’d like a 10-inch strawberry and lemon cake with strawberry buttercream filling, and white chocolate frosting, in two weeks. It's for my son's communion. Please write ‘God Bless Niall.’", "Occasion": "religious", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["strawberry", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hello, this is Sinead. I’d like to order a 10-inch cake with strawberry and lemon layers, filled with strawberry buttercream , and topped with white chocolate frosting, for my son’s communion in two weeks. Please have it decorated with “God Bless Niall.”", "Occasion": "religious", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["strawberry", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hi, I’m Sinead. Could I get a 10″ strawberry-and-lemon cake with strawberry buttercream filling and a white chocolate frosting finish for my son’s communion in two weeks? Please inscribe “God Bless Niall.”", "Occasion": "religious", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["strawberry", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Good afternoon, my name is Melissa. Can I get a 7-inch pumpkin cake for my husband and my wedding anniversary? Id like the cake to have vanilla buttercream filling and vanilla buttercream frosting, for Wednesday, August 7. Please write 'I Love You With All My Heart'.", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["pumpkin"], "Filling": ["vanilla buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Good afternoon! I’m Melissa. I’d like to order a 7-inch Pumpkin cake with vanilla buttercream filling and vanilla buttercream frosting for my husband and my wedding anniversary on Wednesday, August 7. Please write “I Love You With All My Heart” on it.", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["pumpkin"], "Filling": ["vanilla buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello, my name is Melissa. Could I get a 7-inch pumpkin cake filled and frosted with vanilla buttercream for our wedding anniversary on Wednesday, August 7? Please have “I Love You With All My Heart” inscribed.", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["pumpkin"], "Filling": ["vanilla buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "I’d like an 7-inch vanilla and strawberry-flavored cake with strawberry buttercream icing, please write ‘Cheers to 2025!’.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["vanilla", "strawberry"], "Filling": ["unspecified"], "Icing": ["strawberry buttercream"]}
{"Text": "I’d like a 7-inch vanilla-and-strawberry cake with strawberry buttercream icing. Please have it inscribed with “Cheers to 2025!”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["vanilla", "strawberry"], "Filling": ["unspecified"], "Icing": ["strawberry buttercream"]}
{"Text": "Could I order a 7″ vanilla cake flavored with strawberry, iced in strawberry buttercream? Please write “Cheers to 2025!” on it.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["vanilla", "strawberry"], "Filling": ["unspecified"], "Icing": ["strawberry buttercream"]}
{"Text": "Hey my name is Jessica. I’d love a 7-inch lemon cake with pastel-colored buttercream eggs on top for Easter Sunday, April 20. Text: ‘He Is Risen’.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hi, I’m Jessica. I’d like a 7-inch lemon cake decorated with pastel buttercream eggs for Easter Sunday, April 20. Please write “He Is Risen.”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hello, this is Jessica. Could I order a 7″ lemon cake topped with pastel-colored buttercream eggs for Easter Sunday, April 20? Please inscribe “He Is Risen.”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hello—this is Emily. Could I order a half-sheet vanilla with carrot cake and white chocolate ganache filling for Mother’s Day? Please put ‘Happy Mother’s Day!’", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Hello—Emily here. I’d like to order a half-sheet vanilla-and-carrot cake with white chocolate ganache filling for Mother’s Day. Please have it iced with “Happy Mother’s Day!”", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Hi, this is Emily. Can I get a half-sheet cake featuring vanilla and carrot layers, filled with white chocolate ganache, for Mother’s Day? Please write “Happy Mother’s Day!” on it.", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["vanilla", "carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Good afternoon. Can I get an 7-inch chocolate cake with buttercream frosting and peanut butter mousse for Father’s Day? Text: ‘#1 Dad’.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["peanut butter mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Good afternoon! I’d like to order an 7-inch chocolate cake with peanut butter mousse filling and buttercream frosting for Father’s Day. Please have it inscribed with “#1 Dad.”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["peanut butter mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello, could I get an 7″ chocolate cake filled with peanut butter mousse and topped with buttercream for Father’s Day? Please write “#1 Dad.”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["peanut butter mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—John here! Could I get a half-sheet pumpkin cake with cream-cheese frosting for Thanksgiving Day, this week? Please write ‘Give Thanks’.", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "Hello—John here! I’d like to order a half-sheet pumpkin cake with cream-cheese frosting for Thanksgiving Day, this week. Please have it decorated with “Give Thanks.”", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "Hi, this is John. Could I get a half-sheet pumpkin cake topped with cream-cheese frosting for Thanksgiving Day this week? Kindly write “Give Thanks” on it.", "Occasion": "holiday", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "I need a basketball-shaped chocolate and carrot cake with spooky candy decorations for this weekend. Text: ‘Trick or Treat’.", "Occasion": "holiday", "Size": "custom", "Due_Date": "too_soon", "Flavor": ["carrot", "chocolate"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hi there! I’d like a basketball-shaped chocolate and carrot cake adorned with spooky candy decorations for Halloween this weekend. Please have it iced with “Trick or Treat.”", "Occasion": "holiday", "Size": "custom", "Due_Date": "too_soon", "Flavor": ["carrot", "chocolate"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hello! Can I order a basketball-shaped cake combining chocolate and carrot layers, topped with Halloween-themed candy decorations for this weekend? Please write “Trick or Treat” on it.", "Occasion": "holiday", "Size": "custom", "Due_Date": "too_soon", "Flavor": ["carrot", "chocolate"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Hi there—I want a 10-inch almond chocolate cake with almond buttercream frosting and candy cane bits for Christmas. Text: ‘Merry Christmas’.", "Occasion": "holiday", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["almond", "chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hi there—I’d like a 10-inch almond-chocolate cake with almond buttercream frosting and candy cane bits for Christmas. Please write “Merry Christmas.”", "Occasion": "holiday", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["almond", "chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hello! Could I order a 10″ almond and chocolate cake topped with almond buttercream frosting and sprinkled with candy cane pieces for Christmas Day? Please have it inscribed with “Merry Christmas.”", "Occasion": "holiday", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["almond", "chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Carlos here. Can I get a chocolate cake with coconut mousse filling and white chocolate icing for Friday, September 12? It's for my sister's wedding! Text: ‘Mr. & Mrs. Lopez’.", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["coconut mousse"], "Icing": ["white chocolate icing"]}
{"Text": "Hi, this is Carlos. I’d like to order a chocolate cake filled with coconut mousse and frosted with white chocolate for my sister’s wedding on Friday, September 12. Please write “Mr. & Mrs. Lopez” on it.", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["coconut mousse"], "Icing": ["white chocolate icing"]}
{"Text": "Hello—Carlos here. Could I get a chocolate cake with coconut mousse filling and white chocolate frosting for my sister’s wedding on Friday, September 12? Kindly inscribe “Mr. & Mrs. Lopez.”", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["coconut mousse"], "Icing": ["white chocolate icing"]}
{"Text": "Hi—I’m Priya. Can you make a 10-inch marble wedding cake with chocolate and white chocolate mousse layers and buttercream frosting for Saturday, October 10? Please write ‘Best Wishes’.", "Occasion": "wedding", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—I’m Priya. Could I order a 10-inch marble wedding cake with layers of chocolate and white chocolate mousse, finished with buttercream frosting for Saturday, October 10? Please have it iced with “Best Wishes.”", "Occasion": "wedding", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, this is Priya. I’d love a 10″ marble wedding cake featuring chocolate and white chocolate mousse layers and buttercream frosting for Saturday, October 10. Kindly write “Best Wishes.”", "Occasion": "wedding", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate mousse", "white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Good afternoon, my name is Ethan. I’d like a half-sheet vanilla-strawberry wedding cake with fresh strawberry buttercrea, filling and vanilla buttercream icing for Saturday, June 21. Please write ‘To Love & Laughter’.", "Occasion": "wedding", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["strawberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Good afternoon, I’m Ethan. I’d like to order a half-sheet wedding cake flavored with vanilla and strawberry, filled with fresh strawberry buttercream and iced in vanilla buttercream, for Saturday, June 21. Please have it decorated with “To Love & Laughter.”", "Occasion": "wedding", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["strawberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello, my name is Ethan. Could I get a half-sheet vanilla-strawberry wedding cake with fresh strawberry buttercream filling and vanilla buttercream icing for Saturday, June 21? Kindly write “To Love & Laughter” on it.", "Occasion": "wedding", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["strawberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, can I get a full-sheet chocolate wedding cake with chocolate ganache filling and raspberry frosting in two weeks? Text: ‘Forever & Always’.", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate ganache"], "Icing": ["raspberry buttercream"]}
{"Text": "Hi there! I’d like to order a full sheet chocolate wedding cake filled with chocolate ganache and topped with raspberry frosting in two weeks. Please have it inscribed with “Forever & Always.”", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate ganache"], "Icing": ["raspberry buttercream"]}
{"Text": "Hello! Could I get a full-sheet chocolate wedding cake with chocolate ganache filling and raspberry frosting in two weeks? Kindly write “Forever & Always” on it.", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate ganache"], "Icing": ["raspberry buttercream"]}
{"Text": "Hello—this is Diego. We’d like a custom 2-tier wedding cake: 7-inch top and 10-inch bottom, red-velvet cake with cannoli filling and chocolate buttercream frosting, for Saturday, September 5. Please add white sugar roses.", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cannoli"], "Icing": ["chocolate buttercream"]}
{"Text": "Hello—Diego here. We’d like to order a custom two-tier wedding cake (7-inch top tier, 10-inch bottom tier) of red velvet cake with cannoli filling and chocolate buttercream frosting for Saturday, September 5. Please include white sugar roses as decoration.", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cannoli"], "Icing": ["chocolate buttercream"]}
{"Text": "Hi, this is Diego. Can we get a two-tier wedding cake—7″ on top and 10″ on the bottom—made of red velvet cake with cannoli filling and chocolate buttercream frosting for Saturday, September 5? We’d love white sugar roses added.", "Occasion": "wedding", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cannoli"], "Icing": ["chocolate buttercream"]}
{"Text": "Good morning, Maria and Luis here. Can you make a 3-tier wedding cake (7-, 10-, and 14-inch) in lemon with chocolate mousse filling, caramel buttercream frosting, and real orchids? Please put ‘Mr. & Mrs. Garcia’.", "Occasion": "wedding", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["chocolate mousse"], "Icing": ["caramel buttercream"]}
{"Text": "Good morning—Maria and Luis here. We’d like a three-tier lemon wedding cake (7-inch, 10-inch, and 14-inch) filled with chocolate mousse and covered in caramel buttercream frosting, decorated with real orchids. Please inscribe \"Mr. & Mrs. Garcia.\"", "Occasion": "wedding", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["chocolate mousse"], "Icing": ["caramel buttercream"]}
{"Text": "Hello! This is Maria and Luis. Could we order a 7-inch, 10-inch, and 14-inch three-tier lemon cake with chocolate mousse filling, caramel buttercream frosting, and real orchids for our wedding ? Kindly write \"Mr. & Mrs. Garcia.\"", "Occasion": "wedding", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["chocolate mousse"], "Icing": ["caramel buttercream"]}
{"Text": "Hi—I’m Alex. Can I get a 7-inch confetti cake with raspberry filling and fondant frosting for my highschool graduation party? Im looking to have it by this coming weekend. Please write ‘Congrats, Tom!’", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry"], "Icing": ["fondant"]}
{"Text": "Hello, I’m Alex. I’d like to order a 7-inch confetti cake with raspberry filling and fondant frosting for my high school graduation party this coming weekend. Please have it inscribed with “Congrats, Tom!”", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry"], "Icing": ["fondant"]}
{"Text": "Hi, this is Alex. Could I get a 7″ confetti cake filled with raspberry and topped with fondant frosting for my high school graduation celebration this coming weekend? Kindly write “Congrats, Tom!” on it.", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry"], "Icing": ["fondant"]}
{"Text": "Hello—this is Brittany. I’d like a custom baseball shaped marble cake with raspberry mousse filling and white chocolate ganache icing for Friday, May 15, 2025. It's my son's college graduation cake. Please put ‘Well Done, Class of ’25.’", "Occasion": "graduation", "Size": "custom", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello—this is Brittany. Could I order a custom baseball shaped marble cake with raspberry mousse filling and white chocolate ganache frosting for my son’s college graduation on Friday, May 15, 2025? Please have it decorated with “Well Done, Class of ’25.”", "Occasion": "graduation", "Size": "custom", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hi, I’m Brittany. I’d like a custom baseball shaped marble cake filled with raspberry mousse and frosted with white chocolate ganache for Friday, May 15, 2025, as a cake for my son’s college graduation. Please write “Well Done, Class of ’25.”", "Occasion": "graduation", "Size": "custom", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Good morning. Can I order a 1/4-sheet chocolate cake with caramel filling and chocolate ganache for my graduation party on Friday, May 30, 2025? Text: ‘Congrats, Maria!’", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["chocolate ganache"]}
{"Text": "Good morning! I’d like to order a quarter-sheet chocolate cake with caramel filling and a chocolate ganache finish for my graduation party on Friday, May 30, 2025. Please have it iced with “Congrats, Maria!”", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["chocolate ganache"]}
{"Text": "Hello—can I get a 1/4-sheet chocolate cake filled with caramel and topped with chocolate ganache for my graduation celebration on Friday, May 30, 2025? Kindly write “Congrats, Maria!” on it.", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["chocolate ganache"]}
{"Text": "Hey there—I’m Devin. May I get a half-sheet marble cake with chocolate custard, almond buttercream frosting and rainbow sprinkles for my graduation party! Please write ‘You Did It!’", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["marble"], "Filling": ["chocolate custard"], "Icing": ["almond buttercream"]}
{"Text": "Hi, I’m Devin. Could I order a 1/2-sheet marble cake filled with chocolate custard, frosted with almond buttercream and topped with rainbow sprinkles for my graduation party ? Please have it iced with “You Did It!”", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["marble"], "Filling": ["chocolate custard"], "Icing": ["almond buttercream"]}
{"Text": "Hello—Devin here. I’d like a half-sheet marble cake with chocolate custard filling, almond buttercream icing and rainbow sprinkles for my graduation celebration. Please write “You Did It!” on it.", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["marble"], "Filling": ["chocolate custard"], "Icing": ["almond buttercream"]}
{"Text": "Hi. I need a full-sheet red-velvet cake with cream-cheese frosting and decorative scrolls within a week. My daughter just completed her master's degree! Write ‘Mastered It!’ in blue frosting please", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "Hello! I’d like to order a full-sheet red velvet cake with cream-cheese frosting and decorative scrolls within a week. It’s to celebrate my daughter finishing her master’s degree—please write “Mastered It!” in blue frosting.", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "Hi there—could I get a full sheet red-velvet cake topped with cream-cheese frosting and decorative scrolls within a week? It’s for my daughter’s master’s graduation; please inscribe “Mastered It!” in blue.", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["unspecified"], "Icing": ["cream cheese"]}
{"Text": "Good afternoon my name is Cameron. My son just completed his PhD degree and we're looking for a cake to celebrate! I’d love a custom 2-tier wedding-style 7-inch top, 10-inch bottom—in vanilla with chocolate-mousse filling and cookies and cream buttercream frosting for Tuesday, July 1, 2025. Text: ‘Dr. Lee!’", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Good afternoon, I’m Cameron. To celebrate my son earning his PhD, I’d like a custom two-tier, wedding-style cake with a 7-inch top tier and a 10-inch bottom tier, all in vanilla with chocolate-mousse filling and cookies & cream buttercream frosting. We need it for Tuesday, July 1, 2025—please write “Dr. Lee!” on it.", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello, this is Cameron. My son just completed his PhD, and we’d love a two-tier wedding-style cake (7″ top, 10″ bottom) in vanilla with chocolate mousse filling and cookies-and-cream buttercream frosting for Tuesday, July 1, 2025. Kindly have “Dr. Lee!” piped on the cake.", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hi—I’m Riley, I'm looking for a cake to celebrate finishing my Masters. Could I order a 7-inch lemon cake with white chocolate ganache filling and vanilla buttercream for Friday, next week? Please write ‘MBA Class of ’25.’ on it", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["white chocolate ganache"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—I’m Riley. To celebrate finishing my Master’s, could I get a seven-inch lemon cake with white chocolate ganache filling and vanilla buttercream for Friday, next week? Please have it inscribed with “MBA Class of ’25.”", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["white chocolate ganache"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, this is Riley. I’d like to order a 7″ lemon cake filled with white chocolate ganache and frosted with vanilla buttercream for Friday, next week, to celebrate completing my Master’s. Please write “MBA Class of ’25.”", "Occasion": "graduation", "Size": "7-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["white chocolate ganache"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—this is Morgan. Can I get a 3-tier custom medical-school graduation cake (7″, 10″, 14″) flavored vanilla and lemon with strawberry buttercream filling and strawberry buttercream frosting ? Can you write ‘Congratulations, Dr. Patel!’ on the cake?", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "Hello—this is Morgan. I’d like to order a custom three-tier medical-school graduation cake (7″, 10″, and 14″) in vanilla and lemon, filled and frosted with strawberry buttercream. Please write “Congratulations, Dr. Patel!” on it.", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "Hi, I’m Morgan. Could I get a three tier graduation cake for medical school—with 7″, 10″, and 14″ layers flavored vanilla and lemon, and strawberry buttercream filling and frosting? Kindly inscribe “Congratulations, Dr. Patel!” on the cake.", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "lemon"], "Filling": ["strawberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "I’m Jenna. Can I get a seven in vanilla cake for my baby shower?  Id like it with peanut butter mousse filling and raspberry buttercream frosting for Sunday, January 12, 2025? Please write ‘Welcome Baby Emma!’", "Occasion": "baby shower", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["peanut butter mousse"], "Icing": ["raspberry buttercream"]}
{"Text": "Hi, I’m Jenna. For my baby shower on Sunday, January 12, 2025, could I order a seven-inch vanilla cake with peanut butter mousse filling and raspberry buttercream frosting? Please have it inscribed with “Welcome Baby Emma!”", "Occasion": "baby shower", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["peanut butter mousse"], "Icing": ["raspberry buttercream"]}
{"Text": "Hello, this is Jenna. I’d like a 7″ vanilla cake filled with peanut butter mousse and topped with raspberry buttercream for my baby shower on January 12, 2025 (Sunday). Kindly write “Welcome Baby Emma!” on it.", "Occasion": "baby shower", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["peanut butter mousse"], "Icing": ["raspberry buttercream"]}
{"Text": "Hello—this is Marcus, my wife and I are expecting a baby soon and we're looking to buy a cake to celebrate! I’d love a 10-inch chocolate cake with strawberry and raspberry buttercream filling and chocolate buttercream icing for Saturday, February 8, 2025. Please put ‘Baby Boy Jones!’", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry buttercream", "strawberry buttercream"], "Icing": ["chocolate buttercream"]}
{"Text": "Hello—this is Marcus. My wife and I are expecting and would like a 10-in chocolate cake with raspberry and strawberry buttercream filling and chocolate buttercream icing for Saturday, February 8, 2025. Please have it decorated with “Baby Boy Jones!”", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry buttercream", "strawberry buttercream"], "Icing": ["chocolate buttercream"]}
{"Text": "Hi, I’m Marcus. Could I order a 10″ chocolate cake filled with strawberry and raspberry buttercream and frosted with chocolate buttercream for our baby celebration on Saturday, February 8, 2025? Please write “Baby Boy Jones!” on it.", "Occasion": "baby shower", "Size": "10-inch", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry buttercream", "strawberry buttercream"], "Icing": ["chocolate buttercream"]}
{"Text": "Good morning. I need a quarter-sheet confetti baby-shower cake with vanilla buttercream filling and frosted with cookies and cream and caramel buttercream and pastel sprinkles for Sunday, March 23, 2025. Please write ‘It’s a Girl!’", "Occasion": "baby shower", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["confetti"], "Filling": ["vanilla buttercream"], "Icing": ["cookies & cream buttercream", "caramel buttercream"]}
{"Text": "Good morning! I’d like to order a quarter-sheet confetti cake for a baby shower, filled with vanilla buttercream and frosted with cookies and cream and caramel buttercream and pastel sprinkles, scheduled for Sunday, March 23, 2025. Please have it iced with “It’s a Girl!”", "Occasion": "baby shower", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["confetti"], "Filling": ["vanilla buttercream"], "Icing": ["cookies & cream buttercream", "caramel buttercream"]}
{"Text": "Hello—could I get a 1/4-sheet confetti baby-shower cake filled with vanilla buttercream, frosted with cookies and cream and caramel buttercream and pastel sprinkles for Sunday, March 23, 2025? Kindly write “It’s a Girl!” on it.", "Occasion": "baby shower", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["confetti"], "Filling": ["vanilla buttercream"], "Icing": ["cookies & cream buttercream", "caramel buttercream"]}
{"Text": "Hey there, my name is Tyler. Could I order a 1/2-sheet red-velvet cake with cream-cheese filling, almond buttercream frosting and pink roses for Saturday, April 19? The cake is for my sister's baby shower! Please write ‘Oh Baby!’", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["almond buttercream"]}
{"Text": "Hello, I’m Tyler. I’d like to order a half sheet red velvet cake with cream cheese filling, almond buttercream frosting, and pink rose decorations for my sister’s baby shower on Saturday, April 19. Please have it inscribed with “Oh Baby!”", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["almond buttercream"]}
{"Text": "Hey, Tyler here. Could I get a ½-sheet red-velvet cake filled with cream-cheese, frosted with almond buttercream, and adorned with pink roses for my sister’s baby shower on Saturday, April 19? Please write “Oh Baby!” on it.", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["almond buttercream"]}
{"Text": "Hi! This is Rachel. I'm looking to get a custom 2-tier cake for my baby shower. I'd like it to have a 7-inch vanilla top with chocolate ganache and cream cheese filling and a 10-inch chocolate bottom with vanilla-custard filling—both tiers with white chocolate icing, for this Sunday. Put ‘Baby Smith Shower!’ in red icing please!", "Occasion": "baby shower", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla custard", "chocolate ganache", "cream cheese icing"], "Icing": ["white chocolate icing"]}
{"Text": "Hello, this is Rachel. I’d like to order a custom two-tier cake for my baby shower this Sunday. I'd like a 7-inch vanilla top tier with chocolate ganache and cream cheese filling and a 10-inch chocolate bottom tier with vanilla-custard filling, both covered in white chocolate icing. Please pipe “Baby Smith Shower!” in red icing.", "Occasion": "baby shower", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla custard", "chocolate ganache", "cream cheese icing"], "Icing": ["white chocolate icing"]}
{"Text": "Hi! I’m Rachel. Could I get a 2-tier baby shower cake for this Sunday, with a 7″ vanilla top layer filled with chocolate ganache and cream cheese and a 10″ chocolate bottom layer filled with vanilla custard, both frosted in white chocolate icing? Kindly write “Baby Smith Shower!” in red icing.", "Occasion": "baby shower", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla custard", "chocolate ganache", "cream cheese icing"], "Icing": ["white chocolate icing"]}
{"Text": "Hello, Can I order a full-sheet almond anniversary cake with raspberry filling and chocolate ganache for next Monday? It’s our 1st anniversary! Please write ‘One Year Down, Forever to Go.’", "Occasion": "anniversary", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["almond"], "Filling": ["raspberry"], "Icing": ["chocolate ganache"]}
{"Text": "Hello! I’d like to order a full sheet almond anniversary cake with raspberry filling and a chocolate ganache finish for next Monday. It’s our first anniversary—please write “One Year Down, Forever to Go.”", "Occasion": "anniversary", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["almond"], "Filling": ["raspberry"], "Icing": ["chocolate ganache"]}
{"Text": "Hi there—for our 1st anniversary, can I get a full sheet almond cake with raspberry filling and chocolate ganache for next Monday? Please have it iced with “One Year Down, Forever to Go.”", "Occasion": "anniversary", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["almond"], "Filling": ["raspberry"], "Icing": ["chocolate ganache"]}
{"Text": "Good afternoon—I’m David. I need a 3-tier pumpkin cake (7″, 10″, and 14″) with buttercream frosting and white chocolate mousse filling for this week? My wife and I are celebrating our 10th anniversary. Text: ‘Happy 10th Anniversary!’", "Occasion": "anniversary", "Size": "three-tier", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Good afternoon! I’m David. Could I order a three-tier pumpkin cake (7″, 10″, and 14″) with buttercream frosting and white chocolate mousse filling for this week? My wife and I are celebrating our 10th anniversary—please write “Happy 10th Anniversary!” on it.", "Occasion": "anniversary", "Size": "three-tier", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello, this is David. I’d like a 7″, 10″, and 14″ three-tier pumpkin cake topped with buttercream frosting and white chocolate mousse filling for our 10th anniversary this week. Please have “Happy 10th Anniversary!” piped on the cake.", "Occasion": "anniversary", "Size": "three-tier", "Due_Date": "too_soon", "Flavor": ["pumpkin"], "Filling": ["white chocolate mousse"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, my name is Susan Smith. Could I get a 7-inch almond cake with peanut butter mousse filling and cookies&cream buttercream frosting ? It’s our 25th (silver) anniversary—please write ‘25 Years Strong!’", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["peanut butter mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello, I’m Susan Smith. Could I order a 7-inch almond cake filled with peanut butter mousse and frosted with cookies & creamcbuttercream for our 25th (silver) anniversary ? Please have it inscribed with “25 Years Strong!”", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["peanut butter mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hi, Susan Smith here. I’d like a 7″ almond cake with peanut butter mousse filling and cookies and cream buttercream icing to celebrate our silver (25th) anniversary. Kindly write “25 Years Strong!” on the cake.", "Occasion": "anniversary", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["peanut butter mousse"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello—John here. I'm looking to order a custom cake for my wife and I's 50th anniversary! I would like a 10-inch red-velvet cake with cream-cheese filling and caramel buttercream icing. Please write ‘50 Years Together.’", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Hello—John here! I’d like to order a ten-inch red-velvet cake with cream-cheese filling and caramel buttercream frosting for our 50th anniversary. Please pipe “50 Years Together.” on it.", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Hi, this is John. Could I get a 10″ red velvet cake filled with cream-cheese and iced with caramel buttercream for our 50th anniversary? Kindly write “50 Years Together.” on the cake.", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Hey, it’s Michelle, I ordered a cake a couple months ago. Can I get a 1/2-sheet lemon cake with raspberry buttercream filling and strawberry buttercream ? It’s our 5th anniversary—please write ‘Our Sweet Five.’", "Occasion": "anniversary", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["raspberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "Hi, it’s Michelle—I ordered from you a couple of months back. Could I please get a half-sheet lemon cake with raspberry buttercream filling and strawberry buttercream for our 5th anniversary? Please pipe “Our Sweet Five.” on it.", "Occasion": "anniversary", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["raspberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "Hello, Michelle here (I placed an order a few months ago). I’d like to order a ½-sheet lemon cake filled with raspberry buttercream and frosted with strawberry buttercream, to celebrate our 5th anniversary. Kindly write “Our Sweet Five.” on the cake.", "Occasion": "anniversary", "Size": "half-sheet", "Due_Date": "unspecified", "Flavor": ["lemon"], "Filling": ["raspberry buttercream"], "Icing": ["strawberry buttercream"]}
{"Text": "Hi—I’m Laura. I'm looking to order a cake for my son's baptism! I’d like a 7-inch almond cake with chocolate custard filling and cream cheese frosting for Sunday, March 16 2025. Please write ‘Welcome Baby James’.", "Occasion": "religious", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["chocolate custard"], "Icing": ["cream cheese"]}
{"Text": "Hello, I’m Laura. I’d like to order a seven-in almond cake with chocolate custard filling and cream cheese icing for my son’s baptism on Sunday, March 16, 2025. Please have it inscribed with “Welcome Baby James.”", "Occasion": "religious", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["chocolate custard"], "Icing": ["cream cheese"]}
{"Text": "Hi there—Laura here. Could I get a 7″ almond cake filled with chocolate custard and topped with cream cheese frosting for my son’s baptism on March 16, 2025 (Sunday)? Please write “Welcome Baby James” on it.", "Occasion": "religious", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["chocolate custard"], "Icing": ["cream cheese"]}
{"Text": "Good morning, this is Maria. Can I get a vanilla and strawberry cake with coconut mousse filling and frosted with fondant for Sunday, May 4 2025? It is for my granddaughter's Holy Communion. Please put ‘God Bless You, Sophia’.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Good morning—this is Maria. I’d like to order a vanilla cake with coconut mousse filling and fondant frosting for my granddaughter’s Holy Communion on Sunday, May 4, 2025. Please have it inscribed with “God Bless You, Sophia.”", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Hello, I’m Maria. Could I get a vanilla cake filled with coconut mousse and frosted in fondant icing for my granddaughter’s Holy Communion on Sunday, May 4, 2025? Kindly write “God Bless You, Sophia.”", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "strawberry"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Good afternoon, my name is David. I need a almond confirmation cake with white chocolate ganache filling and cream-cheese icing for Sunday, April 27 2025. The writing should be ‘Congratulations, Michael’.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["white chocolate ganache"], "Icing": ["cream cheese"]}
{"Text": "Good afternoon—I’m David. I’d like to order a almond confirmation cake with white chocolate ganache filling and cream-cheese frosting for Sunday, April 27, 2025. Please have it iced with “Congratulations, Michael.”", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["white chocolate ganache"], "Icing": ["cream cheese"]}
{"Text": "Hello, my name is David. Could I get a almond cake to celebrate a confirmation on Sunday, April 27, 2025, featuring white chocolate ganache filling and cream-cheese frosting? Kindly write “Congratulations, Michael” on it.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["almond"], "Filling": ["white chocolate ganache"], "Icing": ["cream cheese"]}
{"Text": "Could I order a chocolate cake with chocolate mousse and peanut butter mousse filling and chocolate ganache for this coming Saturday? My name is Mathew and its for my son's Bat Mitzvah! Please write ‘Mazel Tov, Ethan’.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate mousse", "peanut butter mousse"], "Icing": ["chocolate ganache"]}
{"Text": "Hi, I’m Mathew. Could I order a chocolate cake with peanut butter and chocolate mousse filling and chocolate ganache for my son’s Bat Mitzvah on this coming Saturday? Please have “Mazel Tov, Ethan” written on it.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate mousse", "peanut butter mousse"], "Icing": ["chocolate ganache"]}
{"Text": "Hello, my name is Mathew. I’d like to get a chocolate cake filled with peanut butter and chocolate mousse and finished with chocolate ganache for my son’s Bat Mitzvah this coming Saturday. Kindly pipe “Mazel Tov, Ethan” on the cake.", "Occasion": "religious", "Size": "unspecified", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["chocolate mousse", "peanut butter mousse"], "Icing": ["chocolate ganache"]}
{"Text": "Hi—I’m Rebecca, I need a cake for my daughter's Bat Mitzvah! I’d love a full-sheet vanilla cake with fresh strawberry filling and cookie and cream buttercream frosting for next Saturday. Text: ‘Mazel Tov, Leah’.", "Occasion": "religious", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["strawberry buttercream"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello, I’m Rebecca. I’d like to order a full sheet vanilla cake with fresh strawberry filling and cookies-and-cream buttercream frosting for my daughter’s Bat Mitzvah next Saturday. Please write “Mazel Tov, Leah.”", "Occasion": "religious", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["strawberry buttercream"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hi—it’s Rebecca. Could I get a full-sheet vanilla cake filled with fresh strawberries and frosted with cookies-and-cream buttercream for next Saturday, to celebrate my daughter’s Bat Mitzvah? Kindly inscribe “Mazel Tov, Leah.”", "Occasion": "religious", "Size": "full-sheet", "Due_Date": "too_soon", "Flavor": ["vanilla"], "Filling": ["strawberry buttercream"], "Icing": ["cookies & cream buttercream"]}
{"Text": "This is Omar. Can I get a 2-tier cake for Eid al-Fitr? I'd like a 7″ top and 10″ bottom in chocolate with almond buttercream for this Thursday? Please write ‘Eid Mubarak’.", "Occasion": "religious", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hello, this is Omar. Could I order a two-tier chocolate cake (7″ top tier, 10″ bottom tier) with almond buttercream for Eid al-Fitr on this Thursday? Please have it inscribed with “Eid Mubarak.”", "Occasion": "religious", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hi, I’m Omar. I’d like a 7″ over 10″ two tier chocolate cake filled and frosted with almond buttercream for Eid al-Fitr this Thursday. Kindly pipe “Eid Mubarak” on the cake.", "Occasion": "religious", "Size": "two-tier", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Good afternoon—Fatima here. May I order a 3-tier Eid al-Adha cake (7″, 10″, 14″) flavored red velvet for the bottom two layers and almond for the first layer both filled with white chocolate mousse and with cream cheese frosting? Write down ‘Eid al-Adha Mubarak’ on the cake please.", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["red velvet", "almond"], "Filling": ["white chocolate mousse"], "Icing": ["cream cheese"]}
{"Text": "Good afternoon—this is Fatima. I’d like to order a three-tier Eid al-Adha cake with a 7″ almond layer on top and 10″ and 14″ red-velvet layers below, all frosted in cream-cheese. Please have “Eid al-Adha Mubarak” piped on the cake.", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["red velvet", "almond"], "Filling": ["white chocolate mousse"], "Icing": ["cream cheese"]}
{"Text": "Hello—Fatima here. Could I get a 7″ over 10″ over 14″ three tier cake for Eid al-Adha, featuring an almond top tier and red-velvet middle and bottom tiers, finished with cream-cheese frosting? Kindly write “Eid al-Adha Mubarak” on it.", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["red velvet", "almond"], "Filling": ["white chocolate mousse"], "Icing": ["cream cheese"]}
{"Text": "Hi—I’m Ben. I’d like to order a 7-inch chocolate gelt-themed Hanukkah cake with chocolate-raspberry buttercream filling and frosted with vanilla buttercream. Please write ‘Chag Sameach’.", "Occasion": "religious", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["chocolate buttercream", "raspberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—I’m Ben. I’d like to order a seven in Hanukkah cake decorated with a gelt theme, filled with chocolate and raspberry buttercream and frosted with vanilla buttercream. Please have “Chag Sameach” piped on it.", "Occasion": "religious", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["chocolate buttercream", "raspberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, this is Ben. Could I get a 7″ chocolate gelt-style Hanukkah cake with chocolate, raspberry filling and vanilla buttercream frosting? Kindly write “Chag Sameach.”", "Occasion": "religious", "Size": "7-inch", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["chocolate buttercream", "raspberry buttercream"], "Icing": ["vanilla buttercream"]}
{"Text": "Hello—this is Priya. Diwali is coming soon and I'd like to order a 10-inch red-velvet cake with cream cheese filling and caramel buttercream. I'd like the text to be: ‘Happy Diwali’.", "Occasion": "religious", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Hello, I’m Priya. With Diwali coming up, could I please order a ten-inch red-velvet cake filled with cream cheese and frosted with caramel buttercream? Please have it piped with “Happy Diwali.”", "Occasion": "religious", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Hi—this is Priya. For Diwali, I’d like a ten in red-velvet cake with cream-cheese filling and caramel buttercream frosting. Kindly write “Happy Diwali” on it.", "Occasion": "religious", "Size": "10-inch", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["caramel buttercream"]}
{"Text": "Good morning my name is Sarah. May I order a 1/4-sheet marble cake with chocolate ganache filling and chocolate buttercream frosting for Sunday, September 14 2025? It is for Rosh Hashanah so please write ‘Shanah Tovah’.", "Occasion": "religious", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate ganache"], "Icing": ["chocolate buttercream"]}
{"Text": "Good morning, I’m Sarah. Could I please order a quarter-sheet marble cake with chocolate ganache filling and chocolate buttercream frosting for Rosh Hashanah on Sunday, September 14, 2025? Kindly have it inscribed with “Shanah Tovah.”", "Occasion": "religious", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate ganache"], "Icing": ["chocolate buttercream"]}
{"Text": "Hello, my name is Sarah. May I get a quarter sheet marble cake filled with chocolate ganache and topped with chocolate buttercream for Sunday, September 14, 2025? It’s for Rosh Hashanah—please write “Shanah Tovah.”", "Occasion": "religious", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["marble"], "Filling": ["chocolate ganache"], "Icing": ["chocolate buttercream"]}
{"Text": "Hi, I’m Michael. My neice's birthday is coming up soon an I’d like a 7-inch carrot cake with white chocolate ganache filling! Please write ‘Happy Birthday Joy’. Can I have it for Monday, March 24 2025?", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m Michael. I’d like to order a seven-inch carrot cake filled with white chocolate ganache for my niece’s birthday. Could I get it for Monday, March 24, 2025? Please have it inscribed with “Happy Birthday Joy”", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Hi, Michael here. My niece’s birthday is coming up—could I please get a 7″ carrot cake with white chocolate ganache filling for Monday, March 24, 2025? Kindly write “Happy Birthday Joy” on the cake.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["carrot"], "Filling": ["white chocolate ganache"], "Icing": ["unspecified"]}
{"Text": "Hello—Anna here, I'm looking to order a cake for my daughter's birthday. May I have a 7-inch strawberry cake with vanilla-custard filling for Monday, March 24 2025? Text: ‘Happy 2nd Birthday Nora.’", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["strawberry"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Hi, this is Anna. I’d like to order a seven-inch strawberry cake with vanilla custard filling for my daughter’s birthday on Monday, March 24, 2025. Please write “Happy 2nd Birthday Nora.”", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["strawberry"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Hello—Anna here. Could I get a 7″ strawberry cake filled with vanilla custard for Monday, March 24, 2025, to celebrate my daughter’s birthday? Kindly inscribe “Happy 2nd Birthday Nora.”", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["strawberry"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Good morning—I’m Steven. Can I order a half-sheet chocolate cake with fresh-strawberry filling and WC frosting for this Saturday?  It's for my sister's graduation so please write ‘Congratulations Lily.’", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Good morning—this is Steven. I’d like to order a half sheet chocolate cake with fresh strawberry filling and white-chocolate frosting for my sister’s graduation this Saturday. Please write “Congratulations Lily.”", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hello, I’m Steven. Could I get a 1/2-sheet chocolate cake filled with fresh strawberries and topped with white chocolate frosting for my sister’s graduation this Saturday? Kindly inscribe “Congratulations Lily.”", "Occasion": "graduation", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["chocolate"], "Filling": ["strawberry buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hey my name is Kevin. I need a 10-inch birthday cake. I'd like it to be a lemon cake with no filling and almond buttercream frosting for next Sunday. Text: ‘Happy Birthday Sam.’", "Occasion": "birthday", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hi, I’m Kevin. I’d like to order a ten-inch lemon birthday cake with no filling and frosted with almond buttercream for next Sunday. Please have it decorated with “Happy Birthday Sam.”", "Occasion": "birthday", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "Hello—Kevin here. Can I get a 10″ lemon cake, plain inside (no filling), and iced with almond buttercream for a birthday on next Sunday? Please write “Happy Birthday Sam” on it.", "Occasion": "birthday", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["unspecified"], "Icing": ["almond buttercream"]}
{"Text": "I’m Olivia, Could I get a 1/4-sheet confetti cake with raspberry buttercream filling for the coming Friday? Please write ‘Best Wishes, Anna.’. It is for my friend's birthday party!", "Occasion": "birthday", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hi, I’m Olivia. Could I order a quarter-sheet confetti cake with raspberry buttercream filling for my friend’s birthday party this coming Friday? Please have it inscribed with “Best Wishes, Anna.”", "Occasion": "birthday", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hello, this is Olivia. I’d like a ¼-sheet confetti cake with raspberry buttercream filling for this coming Friday, for my friend’s birthday celebration. Kindly write “Best Wishes, Anna.”", "Occasion": "birthday", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["confetti"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hello—John here. I’d like a full-sheet red-velvet cake with cream-cheese filling for a graduation party I'm hosting. Text: ‘Congrats, Class of 2025.’", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["unspecified"]}
{"Text": "Hi, John here. I’d like to order a full sheet red velvet cake with cream-cheese filling for a graduation party I’m hosting. Please have it piped with “Congrats, Class of 2025.”", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["unspecified"]}
{"Text": "Hello—this is John. Could I get a full-sheet red-velvet cake filled with cream cheese for the graduation celebration I’m holding? Kindly write “Congrats, Class of 2025.”", "Occasion": "graduation", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["unspecified"]}
{"Text": "Good afternoon, this is Emily Mullin. I'm looking for a cake for my wedding anniversary! Can I get a 2-tier vanilla cake (7″ top, 10″ bottom) with no filling? Please write ‘Happy Anniversary.’", "Occasion": "anniversary", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m Emily Mullin. I’d like to order a two tier vanilla cake—7-inch top tier and 10-inch bottom tier—with no filling for our wedding anniversary. Please have it decorated with “Happy Anniversary.”", "Occasion": "anniversary", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Good afternoon—Emily Mullin here. Could I get a 7″ over 10″ two-tier vanilla cake without any filling for our anniversary? Please write “Happy Anniversary” on it.", "Occasion": "anniversary", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Hey my name is Brian. May I have a 3-tier chocolate cake (7″, 10″, 14″) with no filling? Text: ‘Congratulations, College Graduate!’", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Hi, I’m Brian. Could I order a three-tier chocolate cake (7″, 10″, and 14″) with no filling ? Please write “Congratulations, College Graduate!” on it.", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Hello—Brian here. I’d like a 7″, 10″, and 14″ three-tier chocolate cake without any filling. Kindly inscribe “Congratulations, College Graduate!” on the cake.", "Occasion": "graduation", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["no filling"], "Icing": ["unspecified"]}
{"Text": "Hi, this is Michael, I'm ordering a cake for my girlfriend's birthday! I’d like a 7-inch vanilla cake with chocolate mousse filling and a happy-face theme. Please write ‘Happy Birthday Sarah,’ on the cake. I'm looking to have it for Monday, March 24, 2025.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hi, I’m Michael. I’d like to order a seven inch vanilla cake with chocolate mousse filling and a happy-face design for my girlfriend’s birthday. Please have it decorated with “Happy Birthday Sarah,” and ready for Monday, March 24, 2025.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hello—this is Michael. Could I get a 7″ vanilla cake filled with chocolate mousse, styled with a happy-face theme, for my girlfriend’s birthday on Monday, March 24, 2025? Please write “Happy Birthday Sarah,” on it.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hello—I’m Anna. I'm celebrating my daughter's birthday on Monday, March 24 2025! Can I get a 7-inch vanilla birthday cake with vanilla-custard filling and custom artwork? I'd like it to have butterflies and flowers on the cake and please write ‘Happy 2nd Birthday Nora.’", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Hello—I’m Anna. For my daughter’s birthday on Monday, March 24, 2025, could I order a seven-inch vanilla cake with vanilla-custard filling and custom butterfly-and-flower artwork? Please have “Happy 2nd Birthday Nora.” written on it.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Hi, this is Anna. I’d love a 7″ vanilla birthday cake with vanilla custard filling, decorated with butterflies and flowers, for my daughter’s celebration on Monday, March 24, 2025. Kindly inscribe “Happy 2nd Birthday Nora.” on the cake.", "Occasion": "birthday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["vanilla"], "Filling": ["vanilla custard"], "Icing": ["unspecified"]}
{"Text": "Good morning—Joesahadi here. I need a half-sheet chocolate cake for my sister's bridal shower. I'd like the cake to have raspberry filling and white chocolate ganache frosting for Saturday, June 14 2025. Text: ‘Congratulations Lily, We Love You.’", "Occasion": "bridal shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry"], "Icing": ["white chocolate ganache"]}
{"Text": "Good morning—Joesahadi here. I’d like to order a 1/2-sheet chocolate cake with raspberry filling and frosted with white chocolate ganache for my sister’s bridal shower on Saturday, June 14, 2025. Please have it inscribed with “Congratulations Lily, We Love You.”", "Occasion": "bridal shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello, this is Joesahadi. Could I get a half sheet chocolate cake filled with raspberry and topped with white chocolate ganache frosting for my sister’s bridal shower on Saturday, June 14, 2025? Kindly write “Congratulations Lily, We Love You.” on it.", "Occasion": "bridal shower", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["chocolate"], "Filling": ["raspberry"], "Icing": ["white chocolate ganache"]}
{"Text": "Hey—this is Emily, I'm looking for a really nice cake for my 30th anniversary with my husband. Can I order a 10-inch marble cake with raspberry-mousse filling, and custom lace piping, in two weeks? I'd like the writing to be ‘30 Years Together’ on the cake.", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "Hi—this is Emily. For our 30th anniversary in in two weeks, I’d love a ten-inch marble cake with raspberry-mousse filling and custom lace piping. Please have it decorated with “30 Years Together.”", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m Emily. Can I order a 10″ marble cake with raspberry mousse filling and elegant lace-style piping for our 30th anniversary in two weeks? Please write “30 Years Together” on it.", "Occasion": "anniversary", "Size": "10-inch", "Due_Date": "too_soon", "Flavor": ["marble"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "My name is David. I’d like a 1/4-sheet lemon cake with raspberry filling and custom gold-leaf accents, for my son's graduation party. I'd like to have it in two weeks. Please put ‘Congrats, Class of ’25.’", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["raspberry"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m David. Could I order a quarter-sheet lemon cake with raspberry filling and custom gold-leaf accents for my son’s graduation party in two weeks? Please have it inscribed with “Congrats, Class of ’25.”", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["raspberry"], "Icing": ["unspecified"]}
{"Text": "Hi, this is David. I’d like a ¼-sheet lemon cake filled with raspberry and decorated with gold-leaf details for my son’s graduation celebration in two weeks. Kindly write “Congrats, Class of ’25.”", "Occasion": "graduation", "Size": "quarter-sheet", "Due_Date": "too_soon", "Flavor": ["lemon"], "Filling": ["raspberry"], "Icing": ["unspecified"]}
{"Text": "Good morning, Rachel speaking. May I have a 1/2-sheet red-velvet cake for my baby shower? I'd like the cake to have cream-cheese filling and custom cookies and cream frosting floral borders sometime next week? Text: ‘Welcome Baby Grace.’", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Good morning—this is Rachel. For my baby shower sometime next week, could I please order a half-sheet red velvet cake with cream-cheese filling and custom cookies and cream icing floral borders? Please have it decorated with “Welcome Baby Grace.”", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Hello, Rachel here. I’d like a half-sheet red-velvet cake featuring cream-cheese filling and frosted cookies and cream floral border accents for my baby shower sometime next week. Kindly inscribe “Welcome Baby Grace.”", "Occasion": "baby shower", "Size": "half-sheet", "Due_Date": "too_soon", "Flavor": ["red velvet"], "Filling": ["cream cheese icing"], "Icing": ["cookies & cream buttercream"]}
{"Text": "Good afternoon, my name is Mark. I'm having my wedding soon and I was looking to order a full-sheet almond cake with raspberry-mousse filling and hand-painted vines. Please write ‘Mr. & Mrs. Martinez.’", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "Good afternoon! I’m Mark. For my upcoming wedding, I’d like to order a full-sheet almond cake with raspberry–mousse filling and hand-painted vine decorations. Please have “Mr. & Mrs. Martinez” written on it.", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "Hello, my name is Mark. Could I get a full sheet almond wedding cake with raspberry mousse filling and hand-painted vine accents? Kindly inscribe “Mr. & Mrs. Martinez.”", "Occasion": "wedding", "Size": "full-sheet", "Due_Date": "unspecified", "Flavor": ["almond"], "Filling": ["raspberry mousse"], "Icing": ["unspecified"]}
{"Text": "Hi—it’s Jessica. Can you make a 2-tier vanilla and confetti graduation cake (7″ top, 10″ bottom) with chocolate-mousse filling and a custom school-logo topper? Writing: ‘Well Done, Alex.’", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "confetti"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hi—it’s Jessica. Could I order a two-tier vanilla bottom and confetti top graduation cake (7″ top tier, 10″ bottom tier) with chocolate-mousse filling and a custom school-logo topper? Please write “Well Done, Alex.”", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "confetti"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m Jessica. I’d like a 7″ over 10″ two-tier confetti top and vanilla bottom cake for graduation, filled with chocolate mousse and topped with our school logo. Kindly inscribe “Well Done, Alex.”", "Occasion": "graduation", "Size": "two-tier", "Due_Date": "unspecified", "Flavor": ["vanilla", "confetti"], "Filling": ["chocolate mousse"], "Icing": ["unspecified"]}
{"Text": "My name is Omar, I need a 3-tier chocolate Eid cake (7″, 10″, 14″) with caramel buttercream filling and a white chocolate icing crescent-moon decoration. Please write ‘Eid Mubarak.’", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hello, I’m Omar. I’d like to order a three-tier chocolate Eid cake—7″, 10″, and 14″ tiers—with caramel buttercream filling and a frosted white chocolate crescent-moon decoration. Please have “Eid Mubarak.” written on it.", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hi, this is Omar. Could I get a 7″ over 10″ over 14″ three tier chocolate cake for Eid, filled with caramel buttercream and iced with a white chocolate crescent moon? Kindly pipe “Eid Mubarak.” on the cake.", "Occasion": "religious", "Size": "three-tier", "Due_Date": "unspecified", "Flavor": ["chocolate"], "Filling": ["caramel buttercream"], "Icing": ["white chocolate icing"]}
{"Text": "Hey—it’s Priya, I'm celebrating Valentine's Dat with my boyfriend and I'm looking for a 7-inch red-velvet cake with raspberry buttercream filling and custom heart-shaped piping for Friday, Feb 14 2025? Please put: ‘Be Mine.’ on the cake", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hi—it’s Priya. For Valentine’s Day on Friday, February 14, 2025, I’d love a seven inch red-velvet cake with raspberry buttercream filling and heart-shaped piping. Please have it decorated with “Be Mine.”", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hello, I’m Priya. Could I order a 7″ red-velvet cake filled with raspberry buttercream and adorned with custom heart piping for Valentine’s Day (Friday, Feb 14, 2025)? Kindly write “Be Mine.” on it.", "Occasion": "holiday", "Size": "7-inch", "Due_Date": "explicit", "Flavor": ["red velvet"], "Filling": ["raspberry buttercream"], "Icing": ["unspecified"]}
{"Text": "Hi my name is Stacy! I'd like to order a half sheet vanilla and chocolate cake, filled with cannoli and topped with buttercream, for my sister's gender reveal party on Saturday, March 22nd. It should say 'Little Girl Coming.' Thanks!", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi, I'm Stacy! I'd like to order a half-sheet vanilla and chocolate cake, filled with cannoli and topped with buttercream, for my sister's baby gender reveal party on Saturday, March 22nd. Please decorate it with the slogan 'A Wild Little Thing Is Coming.' Thank you! ", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["vanilla buttercream"]}
{"Text": "Hey, I'm Stacy. Could I buy a half-sheet vanilla chocolate cake filled with cannoli and topped with buttercream frosting for my sister's gender reveal party on Saturday, March 22nd? Please write 'Little Forest is Coming!' Thank you very much!", "Occasion": "gender reveal", "Size": "half-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["vanilla buttercream"]}
{"Text": "Hi my name is Stacy! I'd like to order a quarter-sheet vanilla and chocolate cake, filled with coconut mousse and topped with fondant , for my sister's gender reveal party on Saturday, March 22nd. It should say 'Little Girl Coming.' Thanks!", "Occasion": "gender reveal", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Hi, I'm Stacy! I'd like to order a 1/4-sheet vanilla and chocolate cake, filled with coconut mousse and frosted with fondant, for my sister's baby gender reveal party on Saturday, March 22nd. Please decorate it with the slogan 'A Wild Little Thing Is Coming.' Thank you! ", "Occasion": "gender reveal", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Hey, I'm Stacy. Could I buy a quarter sheet vanilla chocolate cake filled with coconut mousse and topped with fondant frosting for my sister's gender reveal party on Saturday, March 22nd? Please write 'Little Forest is Coming!' Thank you very much!", "Occasion": "gender reveal", "Size": "quarter-sheet", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["coconut mousse"], "Icing": ["fondant"]}
{"Text": "Hi, my name is Stacy! I would like to order a vanilla and chocolate cake filled with cannoli and topped with chocolate ganache for my sister's gender reveal party on Saturday, March 22nd. It should say 'Baby Girl is Coming.' Thank you.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["chocolate ganache"]}
{"Text": "Hi, I'm Stacey! I'd like to order a vanilla and chocolate cake filled with cannoli and frosted with chocolate ganache for my sister's baby gender reveal party on Saturday, March 22. Please decorate it with the slogan 'A Wild Little Thing Is Coming'. Thank you!", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["chocolate ganache"]}
{"Text": "Hi, I'm Stacey. Can I purchase a vanilla chocolate cake filled with cannoli and decorated with chocolate ganache frosting for my sister's gender-reveal party on Saturday, March 22? Please write 'Little Baby is Coming!' Thank you so much!", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["cannoli"], "Icing": ["chocolate ganache"]}
{"Text": "Hi! It's Lauren. I need a heart-shaped  vanilla and chocolate cake for my daughter's bridal shower. I want it to have vanilla buttercream and chocolate mousse filling and white chocolate ganache frosting for Friday, February 14th. Thank you!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hi, I'm Lauren. I'd like to order a heart-shaped vanilla and chocolate cake, filled with both vanilla buttercream and chocolate mousse, topped with white chocolate ganache frosting, for my daughter's bridal shower on Friday, February 14. Thank you!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello! Hi! It's Lauren. Can I have a  heart-shaped sheet cake with vanilla and chocolate layers, filled with vanilla buttercream and chocolate mousse and covered with white chocolate ganache frosting for my daughter's bridal shower on Friday, February 14? Thank you so much!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["vanilla", "chocolate"], "Filling": ["vanilla buttercream", "chocolate mousse"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello! It’s Jenny. For my daughter’s bridal shower, I want a flower-shaped  pumpkin and chocolate cake. I want it to have cookies & cream buttercream filling and white ganache frosting for Friday February 14th. thank you!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["pumpkin", "chocolate"], "Filling": ["cookies & cream buttercream"], "Icing": ["white chocolate ganache"]}
{"Text": "Hi, I’m Lauren. I would like to order a flower shaped  of pumpkin and chocolate cake, topped cookies and cream buttercream and white ganache frosting for my daughter’s bridal shower on Friday February 14th, thank you!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["pumpkin", "chocolate"], "Filling": ["cookies & cream buttercream"], "Icing": ["white chocolate ganache"]}
{"Text": "Hello! Hello! It’s Lauren. For my daughter’s bridal shower on Friday, February 14, can I make a flower-shaped cake with a pumpkin and chocolate layer and cookies-and-cream buttercream filling covered with white chocolate ganache frosting? thank you so much!", "Occasion": "bridal shower", "Size": "custom", "Due_Date": "explicit", "Flavor": ["pumpkin", "chocolate"], "Filling": ["cookies & cream buttercream"], "Icing": ["white chocolate ganache"]}
{"Text": "Hey, can you make a small cake for our baby’s gender reveal this Sunday?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re doing a gender reveal with close friends, can I get a simple vanilla cake that’s blue inside if it’s a boy?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I need a cake that says ‘He or She?’ for our gender reveal party next weekend.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you do a gender reveal cake where the inside color shows if it’s a boy or girl?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Looking for a small gender reveal cake we can cut open on a video call with family.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We want a cake that says ‘Twinkle Twinkle Little Star, How We Wonder What You Are’ for our gender reveal.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you make half-pink, half-blue cakes for gender reveal parties?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I need a cake that hides pink or blue filling for a surprise gender reveal.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Please make a neutral-looking gender reveal cake with the surprise color only inside.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can I order a donut-style cake with colored cream inside for a gender reveal?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re doing a sports-themed gender reveal, can the cake say ‘Rookie Coming Soon’ and show the color inside?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I’d love a small elegant cake that reveals pink inside when we cut it, for our gender reveal dinner.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you do a gender reveal cake that looks white outside but explodes pink or blue candies when cut?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Need a last-minute gender reveal cake that says ‘Boy or Girl?’ with blue or pink inside.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re hosting a backyard gender reveal, can you make a rustic-style cake with surprise filling?", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I want a gender reveal cake that looks like a gift box and reveals the baby’s gender when sliced.", "Occasion": "gender reveal", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I’m throwing a bridal shower for my best friend, can you make a classy floral cake?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Need a simple white cake with gold accents for a small bridal shower brunch.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a cake that says ‘From Miss to Mrs.’ for a bridal shower?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Looking for a delicate pink and white cake with roses for my sister’s bridal shower.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re hosting a tea-party themed bridal shower, can the cake be soft pastel colors with her name?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you make heart-shaped cakes for bridal showers with custom messages?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I need a small elegant cake with lace piping details for a bridal shower of 15 people.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can we get a bridal shower cake that matches a greenery and eucalyptus theme?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Please make a cake that says ‘Bride to Be’ with champagne glasses for a bridal shower.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I’d like a rustic naked cake with fresh flowers for an outdoor bridal shower.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re celebrating a bridal shower at a restaurant, can you make a small but fancy cake we can bring?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you do engagement ring–themed cakes for bridal showers?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a bridal shower cake inspired by the bride’s wedding colors: navy and blush?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Need a bridal shower cake that says ‘She said yes!’ in cursive on top.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I want a simple two-layer cake with pearls and flowers for a classy bridal shower.", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you design a lingerie-themed cake for a fun bridal shower (still tasteful)?", "Occasion": "bridal shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re having a baby shower next month, can you make a cute teddy bear cake?", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I need a pastel-colored baby shower cake that says ‘Welcome Little One’.", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a baby shower cake with small booties and blocks on top?", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We want a neutral baby shower cake since we don’t know the gender yet.", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I’d like a baby shower cake with clouds and stars for our ‘twinkle twinkle’ theme.", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you make diaper cake–style designs in actual cake form for baby showers?", "Occasion": "baby shower", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can I order a small chocolate birthday cake that says ‘Happy Birthday Mom’?", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I need a funfetti birthday cake for my friend’s 21st with simple writing.", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you make number-shaped cakes for kids’ birthday parties?", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "I’m looking for a minimalist vanilla birthday cake with just ‘Happy Birthday Alex’.", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a soccer-themed birthday cake for a 10-year-old boy?", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We want a small elegant birthday cake for a coworker, nothing too decorated.", "Occasion": "birthday", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a romantic wedding cake with white buttercream and fresh flowers?", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We need a simple two-tier wedding cake for a small ceremony next month.", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Do you do semi-naked wedding cakes with berries on top?", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Looking for a classic white wedding cake with our initials on the side.", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "Can you make a modern geometric wedding cake with gold accents?", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
{"Text": "We’re having a tiny courthouse wedding, can we get a single-tier wedding cake?", "Occasion": "wedding", "Size": "unspecified", "Due_Date": "unspecified", "Flavor": ["unspecified"], "Filling": ["unspecified"], "Icing": ["unspecified"]}
