{"Text": "Hi, I’m Michael. My neice's birthday is coming up soon an I’d like a 7-inch vanilla cake with chocolate ganache filling! Please write ‘Happy Birthday Joy,’ Can I have it for Monday, March 24 2025?", "Complexity": "simple"}
{"Text": "Hello, I’m Michael. I’d like to order a 7-inch vanilla cake filled with chocolate ganache for my niece’s birthday. Could I get it for Monday, March 24, 2025? Please have it inscribed with “Happy Birthday Joy.”", "Complexity": "simple"}
{"Text": "Hi, Michael here. My niece’s birthday is coming up—could I please get a 7″ vanilla cake with chocolate ganache filling for Monday, March 24, 2025? Kindly write “Happy Birthday Joy” on the cake.", "Complexity": "simple"}
{"Text": "Hello—Anna here, I'm looking to order a cake for my daughter's birthday. May I have a 7-inch vanilla cake with vanilla-custard filling for Monday, March 24 2025? Text: ‘Happy 2nd Birthday Nora.’", "Complexity": "simple"}
{"Text": "Hi, this is Anna. I’d like to order a 7-inch vanilla cake with vanilla custard filling for my daughter’s birthday on Monday, March 24, 2025. Please write “Happy 2nd Birthday Nora.”", "Complexity": "simple"}
{"Text": "Hello—Anna here. Could I get a 7″ vanilla cake filled with vanilla custard for Monday, March 24, 2025, to celebrate my daughter’s birthday? Kindly inscribe “Happy 2nd Birthday Nora.”", "Complexity": "simple"}
{"Text": "Good morning—I’m Steven. Can I order a half-sheet chocolate cake with fresh-strawberry filling and white chocolate frosting for Saturday, June 14 2025?  It's for my sister's graduation so please write ‘Congratulations Lily.’","Complexity": "simple"}
{"Text": "Good morning—this is Steven. I’d like to order a half-sheet chocolate cake with fresh strawberry filling and white chocolate frosting for my sister’s graduation on Saturday, June 14, 2025. Please write “Congratulations Lily.”", "Complexity": "simple"}
{"Text": "Hello, I’m Steven. Could I get a half-sheet chocolate cake filled with fresh strawberries and topped with white chocolate frosting for my sister’s graduation on June 14, 2025? Kindly inscribe “Congratulations Lily.”", "Complexity": "simple"}
{"Text": "Hey my name is Kevin. I need a 10-inch birthday cake. I'd like it to be a lemon cake with no filling for Sunday, April 5 2025. Text: ‘Happy Birthday Sam.’", "Complexity": "simple"}
{"Text": "Hi, I’m Kevin. I’d like to order a 10-inch lemon birthday cake with no filling for Sunday, April 5, 2025. Please have it decorated with “Happy Birthday Sam.”", "Complexity": "simple"}
{"Text": "Hello—Kevin here. Can I get a 10″ lemon cake, plain inside (no filling), for a birthday on Sunday, April 5, 2025? Please write “Happy Birthday Sam” on it.", "Complexity": "simple"}
{"Text": "I’m Olivia, Could I get a 1/4-sheet confetti cake with strawberry buttercream filling for Friday, May 16 2025? Please write ‘Best Wishes, Anna.’. It is for my friend's birthday party!", "Complexity": "simple"}
{"Text": "Hi, I’m Olivia. Could I order a quarter-sheet confetti cake with strawberry buttercream filling for my friend’s birthday party on Friday, May 16, 2025? Please have it inscribed with “Best Wishes, Anna.”", "Complexity": "simple"}
{"Text": "Hello, this is Olivia. I’d like a ¼-sheet confetti cake with strawberry buttercream filling for Friday, May 16, 2025, for my friend’s birthday celebration. Kindly write “Best Wishes, Anna.”", "Complexity": "simple"}
{"Text": "Hello—John here. I’d like a full-sheet red-velvet cake with cream-cheese filling for a graduation party I'm hosting on Sunday, July 20 2025. Text: ‘Congrats, Class of 2025.’", "Complexity": "simple"}
{"Text": "Hi, John here. I’d like to order a full-sheet red velvet cake with cream-cheese filling for a graduation party I’m hosting on Sunday, July 20, 2025. Please have it piped with “Congrats, Class of 2025.”", "Complexity": "simple"}
{"Text": "Hello—this is John. Could I get a full-sheet red-velvet cake filled with cream cheese for the graduation celebration I’m holding on Sunday, July 20, 2025? Kindly write “Congrats, Class of 2025.”", "Complexity": "simple"}
{"Text": "Good afternoon, this is Emily Mullin. I'm looking for a cake for my wedding anniversary! Can I get a 2-tier vanilla cake (7″ top, 10″ bottom) with no filling for Sunday, August 10 2025? Please write ‘Happy Anniversary.’", "Complexity": "simple"}
{"Text": "Hello, I’m Emily Mullin. I’d like to order a two-tier vanilla cake—7-inch top tier and 10-inch bottom tier—with no filling for our wedding anniversary on Sunday, August 10, 2025. Please have it decorated with “Happy Anniversary.”", "Complexity": "simple"}
{"Text": "Good afternoon—Emily Mullin here. Could I get a 7″ over 10″ two-tier vanilla cake without any filling for our anniversary on Sunday, August 10, 2025? Please write “Happy Anniversary” on it.", "Complexity": "simple"}
{"Text": "Hey my name is Brian. May I have a 3-tier chocolate cake (7″, 10″, 14″) with no filling for Saturday, September 14 2025? Text: ‘Congratulations, College Graduate!’", "Complexity": "simple"}
{"Text": "Hi, I’m Brian. Could I order a three-tier chocolate cake (7″, 10″, and 14″) with no filling for Saturday, September 14, 2025? Please write “Congratulations, College Graduate!” on it.", "Complexity": "simple"}
{"Text": "Hello—Brian here. I’d like a 7″, 10″, and 14″ three-tier chocolate cake without any filling for Saturday, September 14, 2025. Kindly inscribe “Congratulations, College Graduate!” on the cake.", "Complexity": "simple"}
{"Text": "Hi—Mia here. I’d like a 7-inch strawberry cake with no filling for Wednesday, November 5 2025. Please put ‘Welcome Home!’", "Complexity": "simple"}
{"Text": "Hello—this is Mia. I’d like to order a 7-inch strawberry cake with no filling for Wednesday, November 5, 2025. Please have it inscribed with “Welcome Home!”", "Complexity": "simple"}
{"Text": "Hi, Mia here. Can I get a 7″ strawberry cake plain inside (no filling) for Wednesday, November 5, 2025? Please write “Welcome Home!” on it.", "Complexity": "simple"}
{"Text": "Hello—it’s James. Could I order a 10-inch marble cake with no filling for Tuesday, December 23 2025? Text: ‘Congrats on the Promotion!’", "Complexity": "simple"}
{"Text": "Hello—it’s James. I’d like to order a 10-inch marble cake without any filling for Tuesday, December 23, 2025. Please have it iced with “Congrats on the Promotion!”", "Complexity": "simple"}
{"Text": "Hi, James here. Can I get a 10″ marble cake with no filling for Tuesday, December 23, 2025? Please write “Congrats on the Promotion!” on it.", "Complexity": "simple"}
{"Text": "Hi, this is Michael, I'm ordering a cake for my girlfriend's birthday! I’d like a 7-inch vanilla cake with chocolate mousse filling and a happy-face theme. Please write ‘Happy Birthday Sarah,’ on the cake. I'm looking to have it for Monday, March 24, 2025.", "Complexity": "custom"}
{"Text": "Hi, I’m Michael. I’d like to order a 7-inch vanilla cake with chocolate mousse filling and a happy-face design for my girlfriend’s birthday. Please have it decorated with “Happy Birthday Sarah,” and ready for Monday, March 24, 2025.", "Complexity": "custom"}
{"Text": "Hello—this is Michael. Could I get a 7″ vanilla cake filled with chocolate mousse, styled with a happy-face theme, for my girlfriend’s birthday on Monday, March 24, 2025? Please write “Happy Birthday Sarah,” on it.", "Complexity": "custom"}
{"Text": "Hello—I’m Anna. I'm celebrating my daughter's birthday on Monday, March 24 2025! Can I get a 7-inch vanilla birthday cake with vanilla-custard filling and custom artwork? I'd like it to have butterflies and flowers on the cake and please write ‘Happy 2nd Birthday Nora.’", "Complexity": "custom"}
{"Text": "Hello—I’m Anna. For my daughter’s birthday on Monday, March 24, 2025, could I order a 7-inch vanilla cake with vanilla-custard filling and custom butterfly-and-flower artwork? Please have “Happy 2nd Birthday Nora.” written on it.", "Complexity": "custom"}
{"Text": "Hi, this is Anna. I’d love a 7″ vanilla birthday cake with vanilla custard filling, decorated with butterflies and flowers, for my daughter’s celebration on Monday, March 24, 2025. Kindly inscribe “Happy 2nd Birthday Nora.” on the cake.", "Complexity": "custom"}
{"Text": "Good morning—Joesahadi here. I’d like a custom half-sheet chocolate bridal-shower cake with fresh-strawberry filling and white-chocolate (WC) frosting for Saturday, June 14, 2025. Could you decorate it with sugar-paste roses, edible pearls, and delicate lace piping around the edges? Please write ‘Congratulations Lily, We Love You’ in gold script.", "Complexity": "custom"}
{"Text": "Good morning—this is Joesahadi. Could I order a custom half-sheet chocolate cake for a bridal shower on Saturday, June 14, 2025? I’d like it filled with fresh strawberry, frosted in white chocolate, and adorned with sugar-paste roses, edible pearls, and delicate lace piping around the edges. Please pipe “Congratulations Lily, We Love You” in gold script.", "Complexity": "custom"}
{"Text": "Hello—Joesahadi here. I’d love a half-sheet chocolate bridal-shower cake for Saturday, June 14, 2025, featuring fresh strawberry filling and white-chocolate frosting. Could you decorate it with sugar roses, edible pearls, and fine lace piping, then write “Congratulations Lily, We Love You” in gold script?", "Complexity": "custom"}
{"Text": "Hey—this is Emily, I'm looking for a really nice cake for my 30th anniversary with my husband. Can I order a 10-inch marble cake with raspberry-mousse filling, and handcrafted lace piping, for Sunday, April 5 2025? I'd like the writing to be ‘30 Years Together’ on the cake.", "Complexity": "custom"}
{"Text": "Hi—this is Emily. For our 30th anniversary on Sunday, April 5, 2025, I’d love a 10-inch marble cake with raspberry-mousse filling and one-of-a-kind lace piping. Please have it decorated with “30 Years Together.”", "Complexity": "custom"}
{"Text": "Hello, I’m Emily. Can I order a 10″ marble cake with raspberry mousse filling and elegant lace-style piping for our 30th anniversary on April 5, 2025? Please write “30 Years Together” on it.", "Complexity": "custom"}
{"Text": "My name is David. I’d like a 1/4-sheet lemon cake with raspberry filling and custom gold-leaf accents, for my son's graduation party. I'd like to have it for Friday, May 16 2025. Please put ‘Congrats, Class of ’25.’", "Complexity": "custom"}
{"Text": "Hello, I’m David. Could I order a quarter-sheet lemon cake with raspberry filling and elegant gold-leaf accents for my son’s graduation party on Friday, May 16, 2025? Please have it inscribed with “Congrats, Class of ’25.”", "Complexity": "custom"}
{"Text": "Hi, this is David. I’d like a ¼-sheet lemon cake filled with raspberry and decorated with gold-leaf details for my son’s graduation celebration on Friday, May 16, 2025. Kindly write “Congrats, Class of ’25.”", "Complexity": "custom"}
{"Text": "Good morning, Rachel speaking. May I have a 1/2-sheet red-velvet cake for my baby shower? I'd like the cake to have cream-cheese filling and one-of-a-kind floral borders for Sunday, July 20 2025? Text: ‘Welcome Baby Grace.’", "Complexity": "custom"}
{"Text": "Good morning—this is Rachel. For my baby shower on Sunday, July 20, 2025, could I please order a half-sheet red velvet cake with cream-cheese filling and pretty floral borders? Please have it decorated with “Welcome Baby Grace.”", "Complexity": "custom"}
{"Text": "Hello, Rachel here. I’d like a half-sheet red-velvet cake featuring cream-cheese filling and floral border accents for my baby shower on Sunday, July 20, 2025. Kindly inscribe “Welcome Baby Grace.”", "Complexity": "custom"}
{"Text": "Good afternoon, my name is Mark. I'm having my wedding soon and I was looking to order a full-sheet almond cake with raspberry-custard filling and hand-painted vines for Saturday, August 30 2025. Please write ‘Mr. & Mrs. Martinez.’", "Complexity": "custom"}
{"Text": "Good afternoon! I’m Mark. For my upcoming wedding on Saturday, August 30, 2025, I’d like to order a full-sheet almond cake with raspberry–custard filling and hand-painted vine decorations. Please have “Mr. & Mrs. Martinez” written on it.", "Complexity": "custom"}
{"Text": "Hello, my name is Mark. Could I get a full-sheet almond wedding cake with raspberry custard filling and hand-painted vine accents for Saturday, August 30, 2025? Kindly inscribe “Mr. & Mrs. Martinez.”", "Complexity": "custom"}
{"Text": "Hi—it’s Jessica. Can you make a 2-tier vanilla graduation cake (7″ top, 10″ bottom) with chocolate-mousse filling and a personalized school-logo topper for Thursday, June 12 2025? Writing: ‘Well Done, Alex.’", "Complexity": "custom"}
{"Text": "Hi—it’s Jessica. Could I order a two-tier vanilla graduation cake (7″ top tier, 10″ bottom tier) with chocolate-mousse filling and a decorative school-logo topper for Thursday, June 12, 2025? Please write “Well Done, Alex.”", "Complexity": "custom"}
{"Text": "Hello, I’m Jessica. I’d like a 7″ over 10″ two-tier vanilla cake for graduation, filled with chocolate mousse and topped with our school logo, ready for Thursday, June 12, 2025. Kindly inscribe “Well Done, Alex.”", "Complexity": "custom"}
{"Text": "My name is Omar, I need a 3-tier chocolate Eid cake (7″, 10″, 14″) with caramel buttercream filling and a crescent-moon decoration for Thursday, April 10 2025. Please write ‘Eid Mubarak.’", "Complexity": "custom"}
{"Text": "Hello, I’m Omar. I’d like to order a three-tier chocolate Eid cake—7″, 10″, and 14″ tiers—with caramel buttercream filling and a crescent-moon decoration for Thursday, April 10, 2025. Please have “Eid Mubarak.” written on it.", "Complexity": "custom"}
{"Text": "Hi, this is Omar. Could I get a 7″ over 10″ over 14″ three-tier chocolate cake for Eid, filled with caramel buttercream and decorated with a crescent moon, for Thursday, April 10, 2025? Kindly pipe “Eid Mubarak.” on the cake.", "Complexity": "custom"}
{"Text": "Hey—it’s Priya, I'm celebrating Valentine's Dat with my boyfriend and I'm looking for a 7-inch red-velvet cake with raspberry buttercream filling and heart-shaped piping for Friday, Feb 14 2025? Please put: ‘Be Mine.’ on the cake", "Complexity": "custom"}
{"Text": "Hi—it’s Priya. For Valentine’s Day on Friday, February 14, 2025, I’d love a 7-inch red-velvet cake with raspberry buttercream filling and heart-shaped piping. Please have it decorated with “Be Mine.”", "Complexity": "custom"}
{"Text": "Hello, I’m Priya. Could I order a 7″ red-velvet cake filled with raspberry buttercream and adorned with intricate heart piping for Valentine’s Day (Friday, Feb 14, 2025)? Kindly write “Be Mine.” on it.", "Complexity": "custom"}
{"Text": "Can I get a birthday cake?", "Complexity": "simple"}
{"Text": "I need a cake for my wedding anniversary?", "Complexity": "simple"}
{"Text": "Can I get a cake for my graduation party?", "Complexity": "simple"}
{"Text": "I'd like to order a wedding cake", "Complexity": "simple"}
{"Text": "I need a 6 inch birthday cake for tomorrow.", "Complexity": "simple"}